
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 25 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS-v16
  * azurerm_key_vault_secret.POSTGRES-USER-v16
  * azurerm_key_vault_secret.POSTGRES_DATABASE-v16
  * azurerm_key_vault_secret.POSTGRES_HOST-v16
  * azurerm_key_vault_secret.POSTGRES_PORT-v16
  * module.db-profile-sync-data-v11.azurerm_postgresql_active_directory_administrator.admin
  * module.db-profile-sync-data-v11.azurerm_resource_group.data-resourcegroup
  * module.db-profile-sync-data-v11.azurerm_template_deployment.postgres-paas
  * module.db-profile-sync-data-v11.null_resource.set-user-permissions[0]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[0]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[1]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[2]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[3]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[4]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[5]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[6]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[7]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[8]
  * module.db-profile-sync-data-v11.null_resource.subnet_mappings[9]
  * module.db-profile-sync-data-v11.random_string.password
* Replace
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      ~ id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PASS/2bd26def28c747d4aed09263c7a706c0" -> (known after apply)
      ~ name                    = "profile-sync-POSTGRES-PASS" -> "profile-sync-POSTGRES-PASS-v16" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PASS/versions/2bd26def28c747d4aed09263c7a706c0" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PASS" -> (known after apply)
      - tags                    = {} -> null
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
      ~ version                 = "2bd26def28c747d4aed09263c7a706c0" -> (known after apply)
      ~ versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PASS" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS-v16" {
      - content_type            = "" -> null
      - id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PASS-v16/bd969f70598249cbb49d772d4b4bb03d" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod" -> null
      - name                    = "profile-sync-POSTGRES-PASS-v16" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PASS-v16/versions/bd969f70598249cbb49d772d4b4bb03d" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PASS-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "bd969f70598249cbb49d772d4b4bb03d" -> null
      - versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PASS-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      ~ id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-USER/d5550ba808d04f36bc02cb0c325e6e97" -> (known after apply)
      ~ name                    = "profile-sync-POSTGRES-USER" -> "profile-sync-POSTGRES-USER-v16" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-USER/versions/d5550ba808d04f36bc02cb0c325e6e97" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-USER" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "d5550ba808d04f36bc02cb0c325e6e97" -> (known after apply)
      ~ versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-USER" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES-USER-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER-v16" {
      - id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-USER-v16/2e970c9682a743d5a0d69321bdec618b" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod" -> null
      - name                    = "profile-sync-POSTGRES-USER-v16" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-USER-v16/versions/2e970c9682a743d5a0d69321bdec618b" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-USER-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "2e970c9682a743d5a0d69321bdec618b" -> null
      - versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-USER-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      ~ id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-DATABASE/b6972f01f4de45f38edb6219106f1ba9" -> (known after apply)
      ~ name                    = "profile-sync-POSTGRES-DATABASE" -> "profile-sync-POSTGRES-DATABASE-v16" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-DATABASE/versions/b6972f01f4de45f38edb6219106f1ba9" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-DATABASE" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "b6972f01f4de45f38edb6219106f1ba9" -> (known after apply)
      ~ versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-DATABASE" -> (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-v16" {
      - id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-DATABASE-v16/9a287783ef4e4b9ca6b6561db7ef2053" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod" -> null
      - name                    = "profile-sync-POSTGRES-DATABASE-v16" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-DATABASE-v16/versions/9a287783ef4e4b9ca6b6561db7ef2053" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-DATABASE-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "9a287783ef4e4b9ca6b6561db7ef2053" -> null
      - versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-DATABASE-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      ~ id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-HOST/3369a802b721450ab80290c0d19b8812" -> (known after apply)
      ~ name                    = "profile-sync-POSTGRES-HOST" -> "profile-sync-POSTGRES-HOST-v16" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-HOST/versions/3369a802b721450ab80290c0d19b8812" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-HOST" -> (known after apply)
      - tags                    = {} -> null
      ~ value                   = (sensitive value)
      ~ version                 = "3369a802b721450ab80290c0d19b8812" -> (known after apply)
      ~ versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-HOST" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST-v16" {
      - id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-HOST-v16/2a8539be0716498ca2885eb5cc042418" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod" -> null
      - name                    = "profile-sync-POSTGRES-HOST-v16" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-HOST-v16/versions/2a8539be0716498ca2885eb5cc042418" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-HOST-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "2a8539be0716498ca2885eb5cc042418" -> null
      - versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-HOST-v16" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      ~ id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PORT/d0f5b7ff6c7e4174add276aa8504e5a3" -> (known after apply)
      ~ name                    = "profile-sync-POSTGRES-PORT" -> "profile-sync-POSTGRES-PORT-v16" # forces replacement
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PORT/versions/d0f5b7ff6c7e4174add276aa8504e5a3" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PORT" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "d0f5b7ff6c7e4174add276aa8504e5a3" -> (known after apply)
      ~ versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PORT" -> (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-v16 will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT-v16 is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT-v16" {
      - id                      = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PORT-v16/cdfb8085f0d34f629f87307d50269fab" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod" -> null
      - name                    = "profile-sync-POSTGRES-PORT-v16" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PORT-v16/versions/cdfb8085f0d34f629f87307d50269fab" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-prod/providers/Microsoft.KeyVault/vaults/rd-prod/secrets/profile-sync-POSTGRES-PORT-v16" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "cdfb8085f0d34f629f87307d50269fab" -> null
      - versionless_id          = "https://rd-prod.vault.azure.net/secrets/profile-sync-POSTGRES-PORT-v16" -> null
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-profile-sync-prod"
        name     = "rd-profile-sync-prod"
      ~ tags     = {
          - "Deployment Environment" = "prod"
          - "Team Name"              = "RD"
          - "lastUpdated"            = "2024-05-08T10:46:05Z"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.db-profile-sync-data-v11.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-profile-sync-postgres-db-v11-data-prod/providers/Microsoft.DBforPostgreSQL/servers/rd-profile-sync-postgres-db-v11-prod" -> null
      - login               = "DTS Platform Operations SC" -> null
      - object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - resource_group_name = "rd-profile-sync-postgres-db-v11-data-prod" -> null
      - server_name         = "rd-profile-sync-postgres-db-v11-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.db-profile-sync-data-v11.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-profile-sync-postgres-db-v11-data-prod" -> null
      - location = "uksouth" -> null
      - name     = "rd-profile-sync-postgres-db-v11-data-prod" -> null
      - tags     = {
          - "application"         = "reference-data"
          - "builtFrom"           = "https://github.com/HMCTS/rd-profile-sync.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "production"
          - "managedBy"           = "Reference Data"
        } -> null
    }

  # module.db-profile-sync-data-v11.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rd-profile-sync-postgres-db-v11-data-prod/providers/Microsoft.Resources/deployments/rd-profile-sync-postgres-db-v11-prod" -> null
      - name                = "rd-profile-sync-postgres-db-v11-prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "dbsyncdata"
          - "administratorLoginPassword" = "idQqyw3t05bK%_B?"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6InJlZmVyZW5jZS1kYXRhIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL3JkLXByb2ZpbGUtc3luYy5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3JlZi1kYXRhLXN1cHBvcnQiLCJlbnZpcm9ubWVudCI6InByb2R1Y3Rpb24iLCJtYW5hZ2VkQnkiOiJSZWZlcmVuY2UgRGF0YSJ9"
          - "dbName"                     = "dbsyncdata"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODk5OWRlYzMtMDEwNC00YTI3LTk0ZWUtNjU4ODU1OTcyOWQxL3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJvZC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcm9kL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1wcm9kIn0seyJydWxlX25hbWUiOiJjZnQtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84Y2JjNmYzNi03YzU2LTQ5NjMtOWQzNi03MzlkYjVkMDBiMjcvcmVzb3VyY2VHcm91cHMvY2Z0LXByb2QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdC10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzhjYmM2ZjM2LTdjNTYtNDk2My05ZDM2LTczOWRiNWQwMGIyNy9yZXNvdXJjZUdyb3Vwcy9jZnQtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXByb2Qtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJpZGFtLXByb2QyLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84OTk5ZGVjMy0wMTA0LTRhMjctOTRlZS02NTg4NTU5NzI5ZDEvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLXByb2QyL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWlkYW0tcHJvZDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tcHJvZDIifSx7InJ1bGVfbmFtZSI6ImJhc3Rpb24tcHJvZC12bmV0Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMmIxYWZjMTktNWNhOS00Nzk2LWE1NmYtNTc0YTU4NjcwMjQ0L3Jlc291cmNlR3JvdXBzL2Jhc3Rpb24tcHJvZC1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2Jhc3Rpb24tcHJvZC12bmV0L3N1Ym5ldHMvYmFzdGlvbiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXByb2QtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy81Y2E2MjAyMi02YWEyLTRjZWUtYWFhNy1lNzUzNmM4ZDU2NmMvcmVzb3VyY2VHcm91cHMvc3MtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtcHJvZC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtcHJvZC1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzVjYTYyMDIyLTZhYTItNGNlZS1hYWE3LWU3NTM2YzhkNTY2Yy9yZXNvdXJjZUdyb3Vwcy9zcy1wcm9kLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDEifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1kYXRhLWdhdGV3YXktcHJvZCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzA5NzgzMTVjLTc1ZmUtNGFkYS05ZDExLTFlYjVlMGUwYjIxNC9yZXNvdXJjZUdyb3Vwcy9obWN0cy1odWItcHJvZC1pbnQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9obWN0cy1odWItcHJvZC1pbnQvc3VibmV0cy9zaGFyZWQtZGF0YS1nYXRld2F5In1d"
          - "env"                        = "prod"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "rd-profile-sync-postgres-db-v11-prod"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "rd-profile-sync-postgres-db-v11-data-prod" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.db-profile-sync-data-v11.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "1372378929931047397" -> null
      - triggers = {
          - "db_reader_user" = "DTS JIT Access rd DB Reader SC"
          - "name"           = "rd-profile-sync-postgres-db-v11"
          - "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7876751617856163842" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3459334137112376973" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks00"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4047236915190762952" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks01"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1893567818220832549" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2224497299056703286" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1317968682480711109" -> null
      - triggers = {
          - "rule_name" = "idam-prod2-vnet"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8193691267183661687" -> null
      - triggers = {
          - "rule_name" = "bastion-prod-vnet"
          - "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "733013845734712911" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks00"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "376979470572543830" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks01"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.db-profile-sync-data-v11.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1324213375808671043" -> null
      - triggers = {
          - "rule_name" = "shared-data-gateway-prod"
          - "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        } -> null
    }

  # module.db-profile-sync-data-v11.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "idQqyw3t05bK%_B?" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "idQqyw3t05bK%_B?" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 1 to change, 25 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":852,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->